#include<stdio.h>
#include<Windows.h>
#include<stdlib.h>
#include<time.h>
#include<conio.h>
#include<math.h>
#include<mmsystem.h>
#pragma comment(lib,"Winmm.lib") 
//定義遊戲界面的大小
#define ROW 23 //遊戲區列數
#define COL 86 //遊戲區行數
  
#define NON 0 //標記空
#define WALL 1 //標記牆
#define PWALL 2 //標記可破牆
#define DOOR -1 //標記出口
#define TRAP -2 //標記陷阱 
#define BODY -4 //標記人身
#define HEART -5 //標記心 
  
#define UP 72 //方向鍵：上
#define DOWN 80 //方向鍵：下
#define LEFT 75 //方向鍵：左
#define RIGHT 77 //方向鍵：右
  
#define SPACE 32 //暫停
#define ESC 27 //退出
  
//人朝向座標 
struct Head
{
    int x; //人朝向橫坐標
    int y; //人朝向縱坐標
}head;

//人身座標 
struct Body
{
    int x; //人身橫坐標
    int y; //人身縱坐標
}body;
//上一步人朝向座標 
struct tHead
{
    int x; //人朝向橫坐標
    int y; //人朝向縱坐標
}thead;
//上一步座標 
struct tBody
{
    int x; //人身橫坐標
    int y; //人身縱坐標
}tbody;
//武器座標 
struct Weapon
{
    int x; //武器橫坐標
    int y; //武器縱坐標
}weapon;
//上一步武器座標 
struct tWeapon
{
    int x; //武器橫坐標
    int y; //武器縱坐標
}tweapon;

int force=0;//判斷有沒有推真牆 
int t=0;//暫存朝向蓋掉的東西 
int m;//暫存上一步朝向蓋掉的東西 
int rewall=0;//判斷補印牆 
int s=20; //血量 
int ago=0;//暫存身蓋掉的東西 
int power;//單位向量方向 
int p,q;//暗箭移動單位向量分量 
int n;//紀錄輸入的鍵(鍵值) 
int c=0;//紀錄撞牆次數
int a=0;//紀錄被箭打次數
int dead=0;//紀錄死因 
int aa=0;//紀錄被同一支箭打到的次數
int aaa=0;//計算最後中箭成就 
//存儲遊戲區各個座標上的東西是什麼(基本背景，以便重新開始時還原)
int fposition[ROW][COL]={
						{1,1,-1,-1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		            	{1,1,0,0,0,0,1,1,0,0,-5,0,0,0,2,2,0,0,-5,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,2,2,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,0,0,-5,0,0,0,1,1,0,0,-5,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,0,0,1,1,0,0,0,0,1,1,0,-5,1,1,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,2,2,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,0,2,2,0,0,0,0,2,2,0,-5,1,1,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,2,2,0,0,0,0,1,1},
		            	{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,2,2,0,0,2,2,2,2,2,2,0,0,0,0,1,1},
		            	{1,1,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,0,0,2,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,2,2,0,0,2,2,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,1,1,0,0,0,0,0,0,1,1,1,1,1,1,3,3,3,3,1,1,0,0,2,2,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,1,1,0,0,0,0,0,0,2,2,0,-5,1,3,0,-5,3,1,1,1,0,0,2,2,0,0,2,2,0,0,0,0,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1,1,0,0,0,0,2,2,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,2,2,1,1,1,1,1,1,2,2,1,1,1,1,1,1,3,3,3,3,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1,-5,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,2,0,0,0,0,0,0,1,1,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,-5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,1,1,2,2,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,0,-5,2,2,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,-5,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,2,2,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,1,1,2,2,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,-5,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,2,-5,0,1,1,0,0,1,1,0,0,1,1,-5,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,2,2,1,1,0,0,1,1,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,-5,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,2,2,0,0,0,0,0,0,0,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,2,0,0,2,2,0,0,2,2,2,2,2,2,2,2,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
				   }; 
//存儲遊戲區各個座標上的東西是什麼(遊戲中改變布景)
int position[ROW][COL]={
						{1,1,-1,-1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		            	{1,1,0,0,0,0,1,1,0,0,-5,0,0,0,2,2,0,0,-5,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,2,2,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,0,0,-5,0,0,0,1,1,0,0,-5,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,0,0,1,1,0,0,0,0,1,1,0,-5,1,1,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,2,2,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,0,2,2,0,0,0,0,2,2,0,-5,1,1,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,2,2,0,0,0,0,1,1},
		            	{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,2,2,0,0,2,2,2,2,2,2,0,0,0,0,1,1},
		            	{1,1,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,0,0,2,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,2,2,0,0,2,2,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,1,1,0,0,0,0,0,0,1,1,1,1,1,1,3,3,3,3,1,1,0,0,2,2,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,1,1,0,0,0,0,0,0,2,2,0,-5,1,3,0,-5,3,1,1,1,0,0,2,2,0,0,2,2,0,0,0,0,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1,1,0,0,0,0,2,2,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,2,2,1,1,1,1,1,1,2,2,1,1,1,1,1,1,3,3,3,3,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1,-5,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,2,0,0,0,0,0,0,1,1,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,-5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,1,1,2,2,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,0,-5,2,2,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,-5,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,2,2,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,1,1,2,2,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,-5,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,2,-5,0,1,1,0,0,1,1,0,0,1,1,-5,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,2,2,1,1,0,0,1,1,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,0,0,0,0,0,-5,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,2,2,0,0,0,0,0,0,0,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,2,0,0,2,2,0,0,2,2,2,2,2,2,2,2,0,0,0,0,0,0,1,1,0,0,0,0,1,1},
		            	{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
				   };  


//簡介 
void menu();
//隱藏游標
void HideCursor();
//游標跳轉
void CursorJump(int, int);
//初始化界面
void InitInterface();
//顏色設置
void color(int c);
//初始化人 
void Inithead();
//隨機生成陷阱 
void Randtrap();
//判斷血量與結束
void JudgeFunc(void);
//人動畫 
void Drawpeople(int);
//人移動前進
void Movehead(int, int,int);
//人移動後退 
void Moveback(int,int);
//暗箭生成 
void Randweapon(void);
//按鍵動畫 
void Drawweapon(int);
//暗箭移動 
void weaponrun(void);
//遊戲主體邏輯副程式 
void Game();

int main()
{
	//#pragma warning(disable: n)//將某個警報置為失效
	//#pragma warning (disable:4996) //可以使用標準C語言提供的庫函數
	PlaySound(NULL, NULL,SND_FILENAME|SND_ASYNC|SND_LOOP);//循環播放背景音樂
	system("title 迷宮脫逃"); //設置視窗標題 
	menu();//打開簡介 
	PlaySound(TEXT("bgm.wav"), NULL, SND_FILENAME |SND_ASYNC|SND_LOOP);
    srand((size_t)time(NULL));//根據當前時間生成隨機種子
    system("mode con cols=86 lines=34"); //設置視窗大小
    system("cls"); //清空視窗 
    HideCursor(); //隱藏游標
    InitInterface(); //初始化界面
    Inithead(); //初始化人 
    Randtrap(); //隨機生成陷阱 
    Drawpeople(1); //印出人 
    Randweapon();// 生成暗箭 
    weaponrun();//暗箭移動 
	Game(); //開始遊戲
    return 0;
}
  
void menu()
{
    system("mode con cols=86 lines=25"); //設置視窗大小
    color(14);//設置文字為淡黃色
    printf("*************************************************************************************\n");
    printf("\n                                       迷宮脫逃\n\n");
    printf("-------------------------------------------------------------------------------------\n");
    printf("\n                              按方向鍵上下左右，可以控制方向\n\n");
    printf("                             	   被紫色暗箭打到會扣血\n\n");
    printf("                                  按方向鍵可推倒部分牆壁\n\n");
    printf("                                       推倒牆會扣血\n\n");
    printf("                              到達出口即過關，血量歸零即出局\n\n");
    printf("                                迷宮下方為提示，祝遊戲愉快\n\n");
    printf("-------------------------------------------------------------------------------------\n");
    printf("                         按空格鍵暫停，暫停後按任意鍵繼續遊戲\n");
    printf("-------------------------------------------------------------------------------------\n");
    printf("                                 按Esc鍵可直接退出遊戲\n");
    printf("                                  按r鍵可重新開始遊戲\n");
    printf("*************************************************************************************\n");
    system("pause");
}
  
//用C語言開發遊戲程序時，對於游標閃爍問題，可以通過隱藏游標解決
void HideCursor()
{
    CONSOLE_CURSOR_INFO curInfo; //定義游標信息的結構體變量，標頭檔<windows.h>
    curInfo.dwSize =1; //如果沒賦值的話，游標不隱藏
    curInfo.bVisible=0; //將游標設置為不可見
    HANDLE handle = GetStdHandle(STD_OUTPUT_HANDLE); //獲取控制台
    SetConsoleCursorInfo(handle, &curInfo); //設置游標信息
}
//游標跳轉
void CursorJump(int x, int y)//可以選擇印出的位置 
{
    COORD pos; //定義游標位置的結構體變量
    pos.X = x; //橫坐標
    pos.Y = y; //縱坐標
    HANDLE handle = GetStdHandle(STD_OUTPUT_HANDLE); //獲取控制台
    SetConsoleCursorPosition(handle, pos); //設置游標位置
} 
/*穿牆原因:
1.之前一直奇怪為什麼人會穿牆，後來才知道陣列跟座標的系統對不上，因為當初印的牆壁是正方形，長寬都是一，
但座標單位橫的只有0.5，直的1，也可以理解，因為輸入游標閃的時候都是長方形。所以後來牆壁改印長方形，然後陣列橫向拉長。
2.一開始陣列在外面宣告過一次，但後來又在主程式宣告一次順便賦值，所以副程式用的陣列都是全域的0陣列 
3.但是牆設在一開始宣告的話，會造成按下重新開始牆不復原，因為程式直接從主程式開始跑，所以一開始要軒各兩個陣列以便重新開始
時以原地圖陣列初始化遊玩過後的地圖陣列，主程式要記得放地圖初始化指令*/
 
//初始化界面
void InitInterface()
{
	
	int i,j;
	for(i=0;i<ROW;i++)
	{
		
		for(j=0;j<COL;j++)
		{
			position[i][j]=fposition[i][j];
			if(position[i][j]==NON)
				printf(" ");
			else if(position[i][j]==HEART)
			{
				color(500); //顏色設置為粉紅色 
				printf("@");//印出心 
				color(0); //顏色設置為黑色
			}
			else if(position[i][j]==DOOR)
			{
				color(6); //顏色設置為土黃色 
				printf("#");//印出出口 
			}
			else
			{
				color(11); //顏色設置為淺藍色
				printf("▍");//印出牆 
			}	
			if(j==85)
				printf("\n");
		} 	
	} 
	color(14);//黃色
    CursorJump(8,26); //游標跳轉
    printf("一心不二用");
    CursorJump(8,27); //游標跳轉
    printf("上課不轉頭");
    CursorJump(8,28); //游標跳轉
    printf("到下課左走");
    CursorJump(8,29); //游標跳轉
    printf("牆邊等下歐");
    CursorJump(32,26); //游標跳轉
    printf("循環一二二");
    CursorJump(32,27); //游標跳轉
    printf("方向在左詩");
    CursorJump(32,28); //游標跳轉
    printf("陷阱歡迎踩");
    CursorJump(32,29); //游標跳轉
    printf("暗箭可以追");
	c=0;//記得所有變量在重新開始時都要初始化!!除了會後續賦值的變數，但養成良好習慣就都初始化，不然會忘記 
	a=0;
	force=0;
	t=0;
	rewall=0; 
	ago=0;
	s=20;
	aaa=0;
    color(7); //顏色設置為白色
    CursorJump(0, ROW+1);
    printf("當前血量:");
    color(12); //顏色設置為磚紅色
        for(i=1;i<=s;i++)
        	printf("▍");
}
//顏色設置
void color(int c)
{
    SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), c); //顏色設置
    //注：SetConsoleTextAttribute是一個API（應用程序編程接口）
}

//初始化人 
void Inithead()
{
	//人朝向座標初始化 
    head.x = COL-3;
    head.y = ROW-3; 
    //人身坐標的初始化
    body.x = COL-3;
    body.y = ROW-2;
    //將人身位置進行標記
    position[body.y][body.x]=BODY;
}
//隨機生成陷阱 
void Randtrap()
{
    int i, j;
    do
    {
        //隨機生成陷阱的橫縱坐標
        i = rand()%ROW;
        j = rand()%COL;
    } while(position[i][j]>0); //確保生成陷阱的位置沒有牆，若有牆則重新生成
    position[i][j] = TRAP; //將陷阱位置進行標記
    color(30); //顏色設為籃底30
    CursorJump(j,i); //游標跳轉到生成的隨機位置處
    printf("!"); //印出陷阱 
}

//判斷武血量與結束
void JudgeFunc()
{
	int i,j;
    //若人身到達的位置是陷阱，則血剩二 
    if (ago==TRAP)
    {
    	if(s<4)
    	{
    		s=20; //更新當前血量
    		color(7);
    		CursorJump(COL/2+2,26);
        	printf("恭喜解鎖塞翁失馬成就");
		} 
		else
			s=0;
        dead=1; 
        ago=NON;
        Randtrap(); //重新隨機生成陷阱 
    }
    //若人身到達的位置是心，則血加四 
    if (ago==HEART)
    {
    	ago=NON;
        s+=4; //更新當前血量
        color(12);
        CursorJump((COL/2+2),30);
        printf("恭喜解鎖偷吃點心被抓到成就!");
        int u,g;//判斷心有沒有吃完 
		for(u=0;u<ROW;u++)
		{
			for(g=0;g<COL;g++)
			{
				if(position[u][g]==HEART&&(u!=11&&g!=19))
					break;
			} 	
			if(g!=COL)
				break;
		} 
        if(u==ROW&&g==COL)
        {
        	color(11);
        	CursorJump((COL/2+2),27);
        	printf("恭喜解鎖吃遍天下成就");
		}
    }
    if (force==1)//如果撞到真牆，則血減三 
    {
        s-=3; //更新當前血量
        force=0;
        dead=2;
        color(10);
        CursorJump(COL/2+2,28);
        printf("恭喜解鎖撞牆成就");
    }
    color(7); //顏色設置為白色
    CursorJump(0,ROW+1);
    printf("當前血量:"); //更新血量
    color(12); //顏色設置為紅色
    CursorJump(9,ROW+1);
    for(i=1;i<=s+5;i++)//覆蓋原血量 
    	printf(" ");
    CursorJump(9,ROW+1);
    for(i=1;i<=s;i++)//印出當前血量 
    	printf("▍");
    if (t==DOOR)//判斷到達出口 
    {
    	
        Sleep(1000); //留給玩家反應時間
        system("cls"); //清空視窗 
        color(7); //顏色設為白色
        CursorJump((COL/3),ROW-10);
        printf("恭喜過關!");
        if(c!=0)
        {
        	CursorJump((COL/3),ROW-9);
        	printf("恭喜解鎖撞牆成就");
        	CursorJump((COL/3),ROW-8);
        	printf("共撞%d次真牆",c);
		}
        if(a!=0)
		{
			CursorJump((COL/3),ROW-7);
        	printf("恭喜解鎖中箭成就!");
        	CursorJump((COL/3),ROW-6);
        	printf("共中箭%d次",a);
        	if(aaa>0)
			{
				color(14); //顏色設為黃色
		    	CursorJump(COL/3,ROW-18);
		    	printf("恭喜解鎖一箭%d鵰成就",aaa);
		    	color(6); //顏色設為土黃色
		    	CursorJump(COL/3,ROW-19);
		    	printf("恭喜獲得跑得比箭快之閃電俠稱號");
			}
		} 
		
        else if(c==0&&a==0)
        {
        	CursorJump((COL/3),ROW-5);
        	printf("溫馨提示:遊戲內含10成就8稱號");
		}
        if(c!=0&&a!=0)
        {
        	CursorJump((COL/3),ROW-4);
        	printf("恭喜獲得打不死之蟑螂稱號");
		}
        int u,g;//判斷心有沒有吃完 
		for(u=0;u<ROW;u++)
		{
			for(g=0;g<COL;g++)
			{
				if(position[u][g]==HEART&&(u!=11&&g!=19))
					break;
			} 	
			if(g!=COL)
				break;
		} 
        if(u==ROW&&g==COL)
        {
        	color(11);
        	CursorJump((COL/3),ROW-3);
        	printf("恭喜解鎖吃遍天下成就");
		}
        while (1) //詢問玩家是否再來一局
        {
            char ch;
            color(7); //顏色設置為白色
            CursorJump((COL / 3),ROW-1);
            printf("再來一局?(y/n):");
            scanf("%c",&ch);
            if (ch=='y'||ch=='Y')
            {
            	fflush(stdin);
                system("cls");
                main();
                break;
            }
            else if (ch =='n'|| ch =='N')
            {
            	CursorJump((COL / 3),ROW);
            	printf("遊戲結束");
                exit(0);
            }
            else
            {
                CursorJump((COL / 3), ROW);
                printf("輸入錯誤，請再次輸入");
            }
        }
    }
    //若血量歸零，則遊戲結束
    if(s<=0)
    {
    	PlaySound(TEXT("finish.wav"), NULL,SND_FILENAME|SND_ASYNC|SND_LOOP);//循環播放得獎音樂 
    	int u,g;//判斷心有沒有吃完 
		for(u=0;u<ROW;u++)
		{
			for(g=0;g<COL;g++)
			{
				if(position[u][g]==HEART&&(u!=11&&g!=19))
					break;
			} 	
			if(g!=COL)
				break;
		} 
        Sleep(500); //留給玩家反應時間
        system("cls"); //清空視窗 
        color(7); //顏色設置為白色
        if(dead==0)
        {
        	CursorJump((COL/3),ROW-17);
        	printf("恭喜獲得弱不禁風稱號");
		}
		if(dead==1)
		{
			CursorJump((COL/3),ROW-16);
        	printf("恭喜解鎖一失足成千古恨成就");
		}
		if(dead==2)
		{
			CursorJump((COL/3),ROW-15);
        	printf("恭喜解鎖想不開成就");
		}
		if(dead==3)
		{
			CursorJump((COL/3),ROW-14);
        	printf("恭喜解鎖為牆壁擋箭壯烈犧牲成就");
        	CursorJump((COL/3),ROW-13);
        	printf("恭喜獲得刀槍會入之擋箭牌稱號");
		}
        if(u==ROW&&g==COL)
        {
        	CursorJump((COL/3), ROW-12);
        	printf("恭喜解鎖吃遍天下成就");
		}
        if(c!=0)
        {
        	CursorJump((COL/3),ROW-11);
        	printf("恭喜解鎖撞牆成就");
        	CursorJump((COL/3),ROW-10);
        	printf("共撞%d次真牆",c);
        	if(c>=16) 
        	{
        		CursorJump((COL/3),ROW-9);
        		printf("恭喜獲得終極耐打之破掉的沙包稱號");
			}
			if(c>10)
			{
				CursorJump((COL/3),ROW-8);
        		printf("恭喜獲得癡迷穿牆之bug大師稱號");
			} 
		}
        if(t==3)
        {
        	CursorJump((COL / 3),ROW-7);
        	printf("恭喜獲得為食犧牲之吃貨稱號");
        	CursorJump((COL / 3),ROW-6);
        	printf("恭喜解鎖看得到吃不到成就");
		}
		if(a!=0)
		{
			CursorJump((COL / 3),ROW-5);
        	printf("恭喜解鎖中箭成就!");
        	CursorJump((COL/3),ROW-4);
        	printf("共中箭%d次",a);
        	if(a>3)
        	{
        		CursorJump((COL / 3),ROW-3);
        		printf("恭喜獲得癡迷追箭之暗器大師稱號");
			}
			if(aaa>0)
			{
				color(14); //顏色設為黃色
		    	CursorJump(COL/3,ROW-18);
		    	printf("恭喜解鎖一箭%d鵰成就",aaa);
		    	color(6); //顏色設為土黃色
		    	CursorJump(COL/3,ROW-19);
		    	printf("恭喜獲得跑得比箭快之閃電俠稱號");
		    	if(aaa>5)
		    	{
		    		color(87); //顏色設為紫底 
		    		CursorJump(COL/3,ROW-20);
		    		printf("恭喜打破暗器大師一箭五鵰紀錄");
				}
		    	
			}
		} 
        while (1) //詢問玩家是否再來一局
        {
            char ch;
            color(7); //顏色設置為白色
            CursorJump((COL / 3),ROW-1);
            printf("再來一局?(y/n):");
            scanf("%c",&ch);
            if (ch=='y'||ch=='Y')
            {
            	fflush(stdin);
                system("cls");
                main();
                break;
            }
            else if (ch =='n'|| ch =='N')
            {
            	CursorJump((COL / 3),ROW);
            	printf("遊戲結束");
                exit(0);
            }
            else
            {
                CursorJump((COL / 3), ROW);
                printf("輸入錯誤，請再次輸入");
            }
        }
    }
}

//人動畫 

void Drawpeople(int flag)
{ 
    if (flag == 1) //印人 
    {
    	if(t==WALL)//若牆不可破 
    	{
    		color(70); //顏色設置為紅色
        	CursorJump(head.x, head.y);
        	printf("+"); //印朝向
		}
		else
		{
			color(10); //顏色設置為綠色
        	CursorJump(head.x, head.y);
        	printf("+"); //印朝向
		}
        color(10); //顏色設置為綠色
        CursorJump(body.x, body.y);
        printf("o"); //印身
    }
    else  //覆蓋上一步的身跟朝向
    { 
	 	CursorJump(head.x,head.y);
        printf(" ");
        CursorJump(body.x,body.y);
        printf(" ");
    } 
}

//往後移動 
void Moveback(int d, int e)
{
	
	//座標暫存 
	thead.y=head.y;
	thead.x=head.x;
	m=t;
	t=ago;
	ago=position[body.y-e][body.x-d];//暫存身正要移到的那格原本是什麼
	if(ago!=WALL&&ago!=3)//沒碰到牆的後退 
    {
    	if(ago==PWALL)//如果碰到可破牆要扣一滴血 
    	{
    		s--;
    		dead=0;
		}
    		
    	Drawpeople(0); //先覆蓋上一步畫面
		//position[head.y][head.x]=NON; //移動前朝向的位置標記為空 
    	head.x=body.x;	//移動後坐標更新
		head.y=body.y;
		body.x=body.x-d;
		body.y=body.y-e;
		position[body.y][body.x]=BODY; //移動後空的位置標記為身
		Drawpeople(1); //移動後的畫面
	}
	else//後退碰到牆 
	{
		ago=position[body.y][body.x];
		t=m;
		force++;
		c++;
	} 
	if(rewall!=0&&position[thead.y][thead.x]!=BODY)//補被朝向蓋掉的東西 
    {
    	CursorJump(thead.x,thead.y);
    	if(rewall==-5)
    	{
    		color(500); //顏色設置為粉紅色
			printf("@");//印出心 
			color(0); //顏色設置為黑色
		}
		else if(rewall==-2)
		{
			color(30); //顏色設為籃底30
    		printf("!"); //印出陷阱
		}
		else
		{
			color(11); //顏色設置為淺藍色
			printf("▍");
		}
		rewall=0;
	}
	JudgeFunc();
}

//往前移動加轉頭 
void Movehead(int d, int e,int flag)
{
	thead.y=head.y;
	thead.x=head.x;
    
    if(flag==1)//轉頭並移動 
    {
    	m=ago;
    	ago=t;//暫存身正要移到的那格原本是什麼
		t=position[head.y+e][head.x+d];//暫存朝向正要移到的那格原本是什麼
    	//移動後坐標更新
    	if(ago!=WALL&&ago!=3)//沒碰到牆的前進 
    	{
    		if(ago==PWALL)
    		{
    			s--;
    			dead=0;
			}
    			
    		Drawpeople(0); //先覆蓋上一步畫面
    		position[body.y][body.x] = NON; //移動前身的位置標記為空
    		position[head.y][head.x] = BODY; //移動前朝向的位置變為身
    		body.x = head.x;
    		body.y = head.y;
    		head.x = head.x + d;
    		head.y = head.y + e;
			Drawpeople(1); //移動後的畫面
		}
		else//前進碰到牆 
		{
			force++;
			c++;
			t=position[head.y][head.x];
			ago=m;
		}	
	}
	else//轉頭 
	{
    	//移動後坐標更新
    	Drawpeople(0); //先覆蓋上一步畫面
    	head.x = head.x + d;
    	head.y = head.y + e;
    	t=position[head.y][head.x];//暫存朝向正要移到的那格原本是什麼
    	Drawpeople(1); //移動後的畫面
    }
    if(rewall!=0&&position[thead.y][thead.x]!=BODY)//補被朝向蓋掉的東西 
    {
    	CursorJump(thead.x,thead.y);
    	if(rewall==-5)
    	{
    		color(500); //顏色設置為粉紅色
			printf("@");//印出心 
			color(0); //顏色設置為黑色
		}
		else if(rewall==-2)
		{
			color(30); //顏色設為籃底30
    		printf("!"); //印出陷阱
		}
		else
		{
			color(11); //顏色設置為淺藍色
			printf("▍");
		}
		rewall=0;
	}
	//站存朝向蓋掉的東西 
	rewall=t;
    JudgeFunc();//判斷碰到什麼 
}
//暗箭動畫 
void Drawweapon(int flag)
{ 
    if (flag==1) //印暗箭 
    {
        color(87); //顏色設置為紫底 
        CursorJump(weapon.x,weapon.y);
        printf("*"); //印暗箭 
        color(0); //顏色設置為黑 
    }
	else//覆蓋上一步暗箭 
    {
        CursorJump(tweapon.x,tweapon.y);
        printf(" ");
    }
}
//隨機生成暗箭 
void Randweapon()
{
    //隨機生成暗箭的橫縱坐標及行進方向 
    do
    {
    weapon.y=rand()%ROW;//暗箭y座標 
    weapon.x=rand()%COL;//暗箭x座標
    power=rand()%2;
    p=rand()%2*pow(-1,power);//暗箭移動方向 
    power=rand()%2;
    q=rand()%2*pow(-1,power);//暗箭移動方向
    } while(position[weapon.y][weapon.x]!=NON||(p==0&&q==0)); //確保生成暗箭的位置沒有牆及行進單位向量不為0，若不符則重新生成
    /*do
    {
    weapon.y=rand()%ROW;//暗箭y座標 
    weapon.x=rand()%COL;//暗箭x座標
    } while(position[weapon.y][weapon.x]!=NON); 
    do
    {
    power=rand()%2;
    p=rand()%2*pow(-1,power);//暗箭移動方向 
    power=rand()%2;
    q=rand()%2*pow(-1,power);//暗箭移動方向 
    } while(p==0&&q==0); //移動單位向量不為0，若不符則重新生成
    
    原本直接寫這樣不行因為底下生成方向可能都是0，這樣會造成箭先跳出來，但沒有被畫，又再生成下一個箭，造成玩家莫名中箭
    */ 
    aa=0;
    tweapon.x=weapon.x-p;//更新暗箭前一步座標 
    tweapon.y=weapon.y-q;
    Drawweapon(1);
}
//暗箭移動
void weaponrun()
{
	
	int time=7000,i;
    while (t!=DOOR&&s>0)
    {
        if (time==0)
            time=7000; //time越小，移動速度越快
        while (--time)//控制移動速度的，循環3000次會佔用一點時間
        {
            if (kbhit()!=0) //遊戲重新c或鍵盤被敲擊，則退出循環
                break;
       	}//之前還研究如何使用多緒讓暗箭跟人同時跑，後來發現這樣也可以達到同樣的效果!因為電腦速度很快加上暗箭移動速度慢，而且地圖不大，不太會一直按著方向鍵，所以延遲不會太明顯 。 
        if(time==0)
        {
        	tweapon.x=weapon.x;//更新上一步座標 
        	tweapon.y=weapon.y;
	        weapon.x=p+weapon.x;//更新移動後座標 
			weapon.y=q+weapon.y;
			if(position[tweapon.y][tweapon.x]==NON)
			{
				Drawweapon(0); //先覆蓋上一步畫面
			}
			if(position[weapon.y][weapon.x]==NON||position[weapon.y][weapon.x]==BODY)
			{
				Drawweapon(1); //移動後的畫面
			}
			if(weapon.y>ROW-2||weapon.y<=0||weapon.x>COL-2||weapon.x<0)
			{
				weapon.x=0;
        		weapon.y=0;
				tweapon.x=weapon.x;
        		tweapon.y=weapon.y;
        		if(position[tweapon.y][tweapon.x]==NON)
				{
				Drawweapon(0); //先覆蓋上一步畫面
				}
        		Randweapon();
			}
			if (position[weapon.y][weapon.x]==BODY)
			{
				aa++;
				a++;
				color(13);
				CursorJump(COL/2+2,29);
        		printf("恭喜解鎖中箭成就!");
				CursorJump(9,ROW+1);
				for(i=1;i<=s;i++)
		    		printf(" ");
				s-=5; //更新當前血量
				dead=3;
				color(7); //顏色設為白色
		    	CursorJump(0,ROW+1);
		    	printf("當前血量:"); //更新血量
		    	color(12); //顏色設置為紅色
		    	CursorJump(9,ROW+1);
		    	for(i=1;i<=s;i++)
		    		printf("▍");
		    	if(aa>2)
		    	{
		    		if(aa>aaa)
		    			aaa=aa; 
		    		color(14); //顏色設為黃色
		    		CursorJump(COL/2+2,31);
		    		printf("恭喜解鎖一箭%d鵰成就",aaa);
		    		color(6); //顏色設為土黃色
		    		CursorJump(COL/2+2,32);
		    		printf("恭喜獲得跑得比箭快之閃電俠稱號");
		    		color(15); //顏色設為粉紅色
		    		CursorJump(0,30);
		    		printf("暗器大師:孺子可教也!\n你是我等待已久的傳人!(其實是出不去)\n追暗器秘笈:\n長按方向鍵暗器會暫停，勇敢破記錄吧");
				}
			}
		}
		else//鍵盤被敲擊 
			break;
	}
}

//遊戲主體邏輯函數
void Game()
{
	int d,e;
    n=UP; //開始遊戲時，默認向前移動
    int tmp=0; //記錄移動方向
    //goto first; //第一次進入循環先向默認方向前進
    while (1)
    {
        d=head.x-body.x;
		e=head.y-body.y;
        n=getch(); //讀取鍵值
        //在執行前，需要對所讀取的按鍵進行調整
        switch (n)
        {
        case UP://按前進 
            Movehead(d,e,1);
            weaponrun();
            break;
        case DOWN: //按後退
            Moveback(d,e);
            weaponrun();
            break;
        case LEFT:
        	if(d==0&&e==-1)//朝前 
            	Movehead(-1,1,0);
			else if(d==0&&e==1)//朝後 
            	Movehead(1,-1,0);
			else if(d==-1&&e==0)//朝左 
            	Movehead(1,1,0);
			else if(d==1&&e==0)//朝右 
            	Movehead(-1,-1,0);
			weaponrun();	
            break;
        case RIGHT: 
			if(d==0&&e==-1)//朝前 
            	Movehead(1,1,0);
			else if(d==0&&e==1)//朝後 
            	Movehead(-1,-1,0);
			else if(d==-1&&e==0)//朝左 
            	Movehead(1,-1,0);
			else if(d==1&&e==0)//朝右 
            	Movehead(-1,1,0);	
            weaponrun();
            break;
        case SPACE:
        	system("pause"); //暫停後按任意鍵繼續
            break;
        case ESC:
        	system("cls"); //清空視窗 
            color(14); //顏色設為黃色
            CursorJump(COL/3, ROW / 2);
            printf("  遊戲結束  ");
            exit(0);
        case 'r':
        	system("cls"); //清空屏幕
            main(); //重新執行主程式 
            break; 
        default:
            break;
        }
    }
}
